scottc11/ok-STM32F4/HAL/Inc/common.h
#pragma once

#include "stm32f4xx_hal.h" // important that this is included first, mainly for arm_math.h
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <arm_math.h>
#include "system_clock_config.h"
#include "PinNames.h"
#include "PinPeripherals.h"
#include "BitwiseMethods.h"
#include "error_handler.h"

#define FLASH_SIZE (uint32_t)0x80000

#define RTOS_STACK_SIZE_MAX 2048
#define RTOS_STACK_SIZE_MIN configMINIMAL_STACK_SIZE

#define RTOS_PRIORITY_LOW  1
#define RTOS_PRIORITY_MED  3
#define RTOS_PRIORITY_HIGH 5

#define RTOS_ISR_DEFAULT_PRIORITY 6

#define NUM_GPIO_IRQ_INSTANCES 16
#define NUM_GPIO_INSTANCES 32  // not a hardware limit, just a sanity check

/* Base address of the Flash sectors Bank 1 */
#define ADDR_FLASH_SECTOR_0 ((uint32_t)0x08000000) /* Base @ of Sector 0, 16 Kbytes */
#define ADDR_FLASH_SECTOR_1 ((uint32_t)0x08004000) /* Base @ of Sector 1, 16 Kbytes */
#define ADDR_FLASH_SECTOR_2 ((uint32_t)0x08008000) /* Base @ of Sector 2, 16 Kbytes */
#define ADDR_FLASH_SECTOR_3 ((uint32_t)0x0800C000) /* Base @ of Sector 3, 16 Kbytes */
#define ADDR_FLASH_SECTOR_4 ((uint32_t)0x08010000) /* Base @ of Sector 4, 64 Kbytes */
#define ADDR_FLASH_SECTOR_5 ((uint32_t)0x08020000) /* Base @ of Sector 5, 128 Kbytes */
#define ADDR_FLASH_SECTOR_6 ((uint32_t)0x08040000) /* Base @ of Sector 6, 128 Kbytes */
#define ADDR_FLASH_SECTOR_7 ((uint32_t)0x08060000) /* Base @ of Sector 7, 128 Kbytes */

#define HIGH 1
#define LOW 0

#define BIT_MAX_32 4294967295
#define BIT_MAX_16 65535
#define BIT_MAX_12 4095